{"text": "Bitcoin is great. Which DeFi project should you choose? Which coin should you enter now? More than once this question has been circulating in your head. The answer to it is: none. However, this does not mean that you should stay out of the market. Contents In order not to waste Your time, let's determine if this article is addressed to you? If you are a person who is already on the cryptocurrency market or just taking its first steps on it, then maybe yes. and you do not treat it as your main occupation. If you do not spend a few hours every day researching projects and the market, but want to profit from the upward cryptocurrency trends, then this article is written just for you. If you are a cryptocurrency bank, then ... maybe for you also. Because the crypto landscape is now so extensive that no one is able to comprehend it on their own, because today we will tell you about how to earn money (which is also associated with the risk of e losses) on crypto trends, without the need to tediously select projects in which we want to invest. In traditional financial markets, we have two very interesting instruments. Indices and ETFs. Their common feature is their basket structure. Let's start with the indexes. Probably everyone who has anything to do with financial markets has heard about such stock exchange indices as Dow Jones, SP500, DAX or our Polish WIG20. Such an index is a basket with selected values ​​to which their weight is assigned. The weight determines how much influence the value of the index has on the price of a given stock. For example, the WIG20 index is an index of the twenty largest companies on the Warsaw Stock Exchange. Each of these twenty companies has a specific weight with which it affects the value of the index. Indices seem to be a great investment vehicle for people with the approach: I do not know, but they will earn (on a growing market or a trend). I don't have to choose individual stocks, I take the entire index. Which reflects the entire market (WIG), its specific segment (WIG20) or the industry (WIG.Games). There is only one problem - indices are not a financial instrument. They are a statistical tool that illustrates price changes in individual markets, segments and industries. We can track and observe the value of an index, but we cannot buy an index unit. And here, on traditional markets, ETFs (Exchange Traded Funds) come to our aid. Among them, I will say, we have the so-called index funds. They are a passive investment tool whose portfolio qualitatively and quantitatively reflects a given index. These are instruments that have been enjoying increasing popularity for years. Especially in foreign markets. And no wonder: it is simple and cheap to use, at the same time allowing you to catch the upward trend of a given market or trend. Until now, there has been little talk about indices on cryptocurrency exchanges. The community did not particularly feel the need to create them. Perhaps because, unlike traditional exchanges, where most companies are listed on one market, the most popular coins in crypto are listed on dozens or even hundreds of exchanges. And since most of the most highly valued coins on individual stock exchanges are the same, their indices would be characterized by a very high correlation. Hence the boom of services such as coinmarketcap or Coingecko, which aggregate statistical data on the entire cryptocurrency market. The situation began to change a bit this year, thanks to DeFi. First, we started to have a certain trend in the market that was not correlated with the entire market. Secondly, it is DeFi that is a place where new financial products can be created. So at the moment, these are the most common indices available on decentralized platforms, the vast majority of which try to reflect the trend of decentralized finance. Since these indices have a tokenized form (you can buy a token, i.e. a unit of the index), we can say that they are also ETFs. Two in One. Please, have a look at Decentralized Crypto Indices! The indexes I present are based on decentralized solutions. However, recently there are also indices created by centralized exchanges, the tokens of which we can buy on them. There was no place for them in this article, but we will mention them during. In all the cases discussed, these indices allow us to participate in the DeFi trend. We will probably have to wait for other solutions. I myself would like to see indexes with names like ORACLES, ETHKILLERS or POLKADOT. Probably the first decentralized index on the market, allowing us to be exposed to the DeFi trend. Its first version appeared over a year ago, at the end of November 2019. In the middle of the hot DeFi summer, the composition of the index has changed. There are new coins and the possibility of dynamic management of the warehouse m and index weights. At the time of writing this article, the composition of the sDeFi index was as follows: Capitalization: USD 3.9 million This index is an element. This means that it is not backed by actual project tokens in the index. And its value is based on the price information collected from the outside (using the CHAINLINK oracle). The advantage of this solution is the lack of price deviations of the index token even with its relatively low liquidity. This is due to the mechanism of operation of the Synthetix Network, in which each of the tokens uses the full liquidity of the protocol, and the price always comes from the oracle and the transactions that are not concluded do not change it. Learn more about the mechanics behind sDEFI and other synthetic Synthetix tokens in. The token can be purchased at. An interesting fact is that sDEFI also has its inverted twin brother iDEFI. It is a token whose price changes inversely to the price of the coins included in the index. It is therefore the perfect tool to short on the trend of decentralized finance. The PieDAO project offers several different products that we can call cryptocurrency indices or ETFs. Let's take a look at a few of them, bearing in mind that the community is constantly proposing new indexes that may appear on PieDAO in some time, while PEDAO underneath uses Balancer. So the indexes from this project contain the actual tokens of the projects included in the index underneath. Moreover, they provide a liquidity pool for decentralized applications, therefore they generate additional revenue from fees paid by token traders based on these pools. DeFi Large Cap Project Index. It contains proven projects, so it is a good solution for conservative investors who do not want to risk looking for new trend stars. They are interested in a more certain and stable profit from the further growth of the trend, so they are betting on its current leaders. Index Composition: Capitalization: USD 2MDeFi Small Cap Project Index. You could say that this is an index of potential DeFi emerging stars. On those who manage to shine, it will be possible to earn more than the market rate of return. However, we have the risk that not all projects will be able to do this. Index composition: Capitalization: $ 1.1 million An index focusing on the entire DeFi trend. It is an example of one of the great things about DeFi - compositional. This feature allows one existing product to be used as a component of another. The DEFI ++ index includes the two previously discussed indices in the following composition: Capitalization: USD 0.6 million .. And even better, because you will pay much less for gas. Here we are exposed to the three most fundamentally strong trends in the crypto industry: Bitcoin, Ethereum and DeFi. Capitalization: $ 1.4 million. And even better, because you will pay a lot less for gas. The index was designed by the creators of the DeFiPulse website. It can be said that this site is the CoinMarketCap counterpart for DeFi protocols. The index is based on the Tokensets technology and is available through this project. The weights in the index are systematically updated based on the capitalization of individual assets. Index composition: Capitalization: USD 23 million The index has a built-in fee for its creators, amounting to 0.95 percent of the index capitalization during the year. Finally, a very interesting ecosystem supported by a bigger idea. Not only creating token indices to have exposure to a given market. But also in order to use the management power of tokens in the index. Recall that most DeFi tokens are tokens that can be voted on in the protocols. Defining the directions of development or parameters of a given project. Few, however, use their tokens for these purposes. This is due, firstly, to a lack of awareness and, secondly, to the transaction fees associated with it. Collecting more of these tokens together in an index can be a factor in activating the management power of the tokens. Now let's move on to the two currently available indices (more are on the way), an index that seeks to reflect the strongest projects in the DeFi trend. Here is its composition of Capitalization: USD 11.5 million Index for tokens related to. So, apart from YFI, we have on the list other projects co-created by Andre Cronje and projects with which Yearn Finance cooperates. Index composition: Market capitalization: $ 7.3 million What would DeFi be without the possibility of farming? Also, most of the solutions we have discussed allow you to derive additional profit from the index in the form of a protocol managing token, which is responsible for the creation of the index. Typically, this will be a reward for providing liquidity for the index in question. Annual rates of return on this account range from several dozen to several hundred percent per year (but remember which may eat some of the profits or even make us lose out on it). So time to devote to this aspect during our next. Bitcoin is awesome"}